Задания необходимо оформить в формате ipython-notebook (.ipynb). На code style будет так же обращено внимание.

### Задача #1 - Python
- На языке python 3 версии и новее и без использования сторонних библиотек напишите функцию, считывающую с пользовательского ввода целое неотрицательное число $n$, а затем выводящую это число в ячейку вместе с преобразованным словом "программист". $ 0 <= n <= 1000$. Например: 0 программистов, 4 программиста, 11 программистов.

### Задача #2 - SQL
Даны таблицы:
- DEPARTMENTS, с полями: ID (int, pk), NAME (string)
- STAFF, с полями: ID (int, pk), ID_LEAD (int), ID_DEP (int), NAME (string), SALARY (float).
<br> Таблицы DEPARTMENTS и STAFF связаны с помощью полей DEPARTMENTS.ID и STAFF.ID_DEP

Напишите SQL запрос для решения следующих задач:
- Выведите наименование отдела с наибольшим числом сотрудников
- Выведите ID сотрудников с зарплатой выше, чем у руководителя
- Выведите ID отделов, число сотрудников в которых меньше 3 человек

In [20]:
# Пример таблиц
import pandas as pd
DEPARTMENTS = pd.DataFrame({'ID':[1,2,3,4], 'NAME': ['Отдел разработки','Отдел CRM','Служба безопасности','Риски']})
DEPARTMENTS

   ID                 NAME
0   1     Отдел разработки
1   2            Отдел CRM
2   3  Служба безопасности
3   4                Риски

In [24]:
# Пример таблиц
STAFF = pd.DataFrame({
    'ID':[1,2,3,4], 
    'ID_LEAD': [2,2,3,4],
    'ID_DEP': [1,1,3,4],
    'NAME': ['ИВАН', 'МАКСИМ', 'АЛЕКСАНДРА', 'МАРИЯ'],
    'SALARY': [94000.00, 138000.33, 192003.22, 57800],
})
STAFF

   ID  ID_LEAD  ID_DEP        NAME     SALARY
0   1        2       1        ИВАН   94000.00
1   2        2       1      МАКСИМ  138000.33
2   3        3       3  АЛЕКСАНДРА  192003.22
3   4        4       4       МАРИЯ   57800.00

* Выведите наименование отдела с наибольшим числом сотрудников

* Выведите ID сотрудников с зарплатой выше, чем у руководителя

- Выведите ID отделов, число сотрудников в которых меньше 3 человек

### Задача #3 - Python ML
Постройте модель по оценке вероятности оттока на основе данных ***telecom_churn.csv*** (задача классификации - 2 класса). Оцените качество полученной модели.